In [2]:
import pandas as pd
import numpy as np

In [3]:
data = { 'state' :  ['kpk' , 'punjab' , 'sindh' , 'balochistan'],
         'years' :  ['2005' , '2006' , '2006' , '2008'],
         'population':['1.8' , '1.9' , '2.1', '2.3']
       
       }

In [4]:
frame = pd.DataFrame(data)

In [5]:
frame

         state years population
0          kpk  2005        1.8
1       punjab  2006        1.9
2        sindh  2006        2.1
3  balochistan  2008        2.3

In [6]:
frame1 = pd.DataFrame(data , columns=['population' , 'state' , 'years'])
frame1

  population        state years
0        1.8          kpk  2005
1        1.9       punjab  2006
2        2.1        sindh  2006
3        2.3  balochistan  2008

In [7]:
frame2 = pd.DataFrame(data , columns=['population' , 'state' , 'years'] , index = ['one' , 'two' , 'three' , 'four'])
frame2

      population        state years
one          1.8          kpk  2005
two          1.9       punjab  2006
three        2.1        sindh  2006
four         2.3  balochistan  2008

In [9]:
frame3 = pd.DataFrame(data , columns=['population' , 'state' , 'years' , 'city'] , index = ['one' , 'two' , 'three' , 'four'])
frame3

      population        state years city
one          1.8          kpk  2005  NaN
two          1.9       punjab  2006  NaN
three        2.1        sindh  2006  NaN
four         2.3  balochistan  2008  NaN

In [10]:
frame2['state']

one              kpk
two           punjab
three          sindh
four     balochistan
Name: state, dtype: object

In [11]:
frame2.state

one              kpk
two           punjab
three          sindh
four     balochistan
Name: state, dtype: object

In [18]:
frame2[1:3]

      population   state years
two          1.9  punjab  2006
three        2.1   sindh  2006

In [25]:
frame2.loc['three']

population      2.1
state         sindh
years          2006
Name: three, dtype: object

In [33]:
frame2["state"]

one              kpk
two           punjab
three          sindh
four     balochistan
Name: state, dtype: object

In [35]:
frame2.loc['two': 'three' , ['state' , 'years']]

        state years
two    punjab  2006
three   sindh  2006

In [39]:
frame2.at['two' , 'state']

'punjab'

In [44]:
frame2.iloc[: , [0,2]]

      population years
one          1.8  2005
two          1.9  2006
three        2.1  2006
four         2.3  2008

In [51]:
frame2.iloc[: , 0:2]

      population        state
one          1.8          kpk
two          1.9       punjab
three        2.1        sindh
four         2.3  balochistan

In [52]:
frame2.iloc[[0,2] , [0,2]]

      population years
one          1.8  2005
three        2.1  2006

In [66]:
pd.DataFrame(np.arange(12).reshape(4,3) , columns=list('abc') , index = ['pesh' , 'islb' , 'lhr' , 'krch'])

      a   b   c
pesh  0   1   2
islb  3   4   5
lhr   6   7   8
krch  9  10  11

In [70]:
frame = pd.DataFrame(np.arange(12).reshape(4,3) , columns=list('abc') , index = ['pesh' , 'islb' , 'lhr' , 'krch'])
frame

      a   b   c
pesh  0   1   2
islb  3   4   5
lhr   6   7   8
krch  9  10  11

In [72]:
series = frame.iloc[0]
series

a    0
b    1
c    2
Name: pesh, dtype: int32

In [73]:
frame - series

      a  b  c
pesh  0  0  0
islb  3  3  3
lhr   6  6  6
krch  9  9  9

In [76]:
series2 = pd.Series(range(3) , index = ['alpha' , 'beta' , 'gamma'])
series2

alpha    0
beta     1
gamma    2
dtype: int64

In [77]:
frame + series2    #needs explanation

       a  alpha   b  beta   c  gamma
pesh NaN    NaN NaN   NaN NaN    NaN
islb NaN    NaN NaN   NaN NaN    NaN
lhr  NaN    NaN NaN   NaN NaN    NaN
krch NaN    NaN NaN   NaN NaN    NaN

In [78]:
series3 = pd.Series(range(3) , index = ['a' , 'b' , 'c'])
series3

a    0
b    1
c    2
dtype: int64

In [79]:
frame + series3

      a   b   c
pesh  0   2   4
islb  3   5   7
lhr   6   8  10
krch  9  11  13

In [84]:
frame.add(series3 , axis = 1)

      a   b   c
pesh  0   2   4
islb  3   5   7
lhr   6   8  10
krch  9  11  13

In [85]:
frame

      a   b   c
pesh  0   1   2
islb  3   4   5
lhr   6   7   8
krch  9  10  11

a    0
b    1
c    2
dtype: int64

In [87]:
series4 = pd.Series(range(3) , index = ['pesh' , 'islb' , 'lhr'])
series4

pesh    0
islb    1
lhr     2
dtype: int64

In [89]:
frame.add(series4 , axis = 0)

        a    b     c
islb  4.0  5.0   6.0
krch  NaN  NaN   NaN
lhr   8.0  9.0  10.0
pesh  0.0  1.0   2.0